[MainMissions.M_dlc4_AreyoufromtheseParts MissionDefinition]
MissionDescription="Patricia Tannis needs parts to build her magnificent... something.  Head down to the Hyperion Dump and search the scrapped claptraps for parts and bring them back to her."
MissionGiver="Tannis"
MissionName="Are You From These Parts?"
MissionSummary="Bring Tannis some claptrap parts."
Objectives[0]=(ProgressMessage="Clap-Component #1:")
Objectives[1]=(ProgressMessage="Clap-Component #2:")
Objectives[2]=(ProgressMessage="Clap-Component #3:")
Objectives[3]=(ProgressMessage="Clap-Component #4:")
Objectives[4]=(ProgressMessage="Clap-Component #5:")
TurnInDescription="You got Tannis her parts! Of course she's still got a couple of screws loose."

[SideMissions.M_dlc4_Burn_Rubber MissionDefinition]
MissionDescription="Those lousy rustbuckets have stolen Marcus' bus tires! Go to the Hyperion Dump and find six good looking tires.  It's time to spruce this old girl up."
MissionGiver="Marcus"
MissionName="Burnin' Rubber"
MissionSummary="Collect six good looking tires for Marcus."
Objectives[0]=(ProgressMessage="Tires:")
TurnInDescription="Six shiny new tires for Marcus' ride! And these hardly have any roadkill in them yet!"

[SideMissions.M_dlc4_TannisParts2 MissionDefinition]
MissionDescription="Tannis needs some more parts to complete her creation's Infinite Improbability Drive.  If you can't find any lying around, just rip them out of some claptrap spines."
MissionGiver="Tannis"
MissionName="Fight For Your Right To Part-E"
MissionSummary="Get some more claptrap components for Tannis."
Objectives[0]=(ProgressMessage="Clap-Component:")
TurnInDescription="Fantastic! This should limit the invention's Improbability factor to -42! Which is a big deal! Really!"

[SideMissions.M_dlc4_TannisParts3 MissionDefinition]
MissionDescription="Tannis needs more parts to ensure the protection grid holds on her device's ecto-containment unit, safeguarding against total protonic reversal, which would be extraordinarily bad."
MissionGiver="Tannis"
MissionName="Parts Is Parts"
MissionSummary="Get even more claptrap components for Tannis."
Objectives[0]=(ProgressMessage="Clap-Component:")
TurnInDescription="You got those parts Tannis needed! It's Filler Time!  If you've got the time, she's got the beer....Filler Beer."

[SideMissions.M_dlc4_TannisParts4 MissionDefinition]
MissionDescription="The 'Popcorn' setting on Tannis' device is malfunctioning.  Well, it's not so much malfunctioning as creating deadly mutant corn.  A few more parts should fix that!"
MissionGiver="Tannis"
MissionName="We All Have Our Part To Play"
MissionSummary="Get lots of claptrap parts for Tannis."
Objectives[0]=(ProgressMessage="Clap-Component:")
TurnInDescription="Those extra parts you found should take care of the giant corn dilemma. Now she'll probably want a shitload of butter."

[SideMissions.M_dlc4_TannisParts5 MissionDefinition]
MissionDescription="Just a few more parts and Tannis' magnum opus shall be revealed! Tremble in fear at the might of Tannis and her fearsome... what is this thing, anyway?"
MissionGiver="Tannis"
MissionName="A Part Of Something Larger Than Yourself"
MissionSummary="Get Tannis a ridiculous amount of claptrap components."
Objectives[0]=(ProgressMessage="Clap-Component:")
TurnInDescription="Thanks to these new parts, Tannis' masterpiece is complete: It's an android version of Tannis!  Now, she'll never be lonely again, and she rewards you handsomely for your efforts. "

